package com.tongc.easyui.newStudy;//
//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                           O\  =  /O
//                        ____/`---'\____
//                      .'  \\|     |//  `.
//                     /  \\|||  :  |||//  \
//                    /  _||||| -:- |||||-  \
//                    |   | \\\  -  /// |   |
//                    | \_|  ''\---/''  |   |
//                    \  .-\__  `-`  ___/-. /
//                  ___`. .'  /--.--\  `. . __
//               ."" '<  `.___\_<|>_/___.'  >'"".
//              | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//              \  \ `-.   \_ __\ /__ _/   .-` /  /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//                      佛祖保佑       永无BUG

/**
 * @Creator: zhang.jiaming
 * @CreationTime: 2019-09-24 13:26
 * @Description: do while循环
 **/

public class MainDoWhile {
    public static void main(String[] args) {
        /*
        * java 中, while循环是先判断循环体条件，在执行循环。而另一种do while循环则是先执行循环，在判断条件，条件满足时继续循环，条件不满足时退出
        * 如下代码 可见 do while 循环会至少循环一次
        * */
        int sum = 0;
        int s = 1;
        do {
            sum=sum+s;
            s++;
        }while (s<=100);
        System.out.println(sum);
    }
    /*
    do while循环先执行循环，再判断条件；
    do while循环会至少执行一次。
    * */

}
