package com.tongc.easyui.study;//
//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                           O\  =  /O
//                        ____/`---'\____
//                      .'  \\|     |//  `.
//                     /  \\|||  :  |||//  \
//                    /  _||||| -:- |||||-  \
//                    |   | \\\  -  /// |   |
//                    | \_|  ''\---/''  |   |
//                    \  .-\__  `-`  ___/-. /
//                  ___`. .'  /--.--\  `. . __
//               ."" '<  `.___\_<|>_/___.'  >'"".
//              | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//              \  \ `-.   \_ __\ /__ _/   .-` /  /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//                      佛祖保佑       永无BUG

/**
 * @Creator: zhang.jiaming
 * @CreationTime: 2019-09-21 17:42
 * @Description: 学习常量和变量
 **/

public class ConstantAndVar {

    /*
    * 常量和变量
    *   常量： 在程序运行过程中，值不会发生改变的量叫常量
    *   变量： 在程序运行过程中，值会发生改变的量叫变量
    *
    *   变量：
    *    1.先声明，后赋值
    *    int a; 声明
    *    a=10; 赋值
    *    2.声明+赋值
    *    int a=10; 声明+赋值
    * */
    public static void main(String[] args) {
        //声明
        int a;
        //赋值
        a=10;
        //声明+赋值
        int b = 10;
        System.out.println("11111111111111111");
    }

}
