package com.tongc.easyui.study;//
//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                           O\  =  /O
//                        ____/`---'\____
//                      .'  \\|     |//  `.
//                     /  \\|||  :  |||//  \
//                    /  _||||| -:- |||||-  \
//                    |   | \\\  -  /// |   |
//                    | \_|  ''\---/''  |   |
//                    \  .-\__  `-`  ___/-. /
//                  ___`. .'  /--.--\  `. . __
//               ."" '<  `.___\_<|>_/___.'  >'"".
//              | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//              \  \ `-.   \_ __\ /__ _/   .-` /  /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//                      佛祖保佑       永无BUG

/**
 * @Creator: zhang.jiaming
 * @CreationTime: 2019-09-21 15:25
 * @Description: 学习标识符
 **/

public class IdeatifiedDemo {
    /*
    * 标识符命名规范
    *   硬性规定：
    *      1.标识符必须以字母，下划线和美元符开头
    *      2.其他部分也必须是字母，数字，下划线和美元符号，但是不能出现特殊符号 比如 + * 等
    *      3.大小写敏感，长度无限制
    *      4.不可以使用java关键字
    *    常规建议：
    *      1.驼峰标识
    *        1.类名，接口名称在命名的时候要首字母大写
    *        2.方法,变量命名的时候首字母小写
    *        3.多个单词拼接表示一个标识符的时候 每个单词的首字母要大写
    *      2.见名知义
    *        1.通过标识符的名称能知道代表的含义
    *        2.千万不要写拼音
    * */
    public static void main(String[] args){
        int _a =10;
        int $b=20;
        int c=_a+$b;
        int getValueById=_a;
        int getvaluebyid=$b;
    }
}
